class NameOfButton:
    CANCEL = '❌Отменить действие'

    ADD_NEW_USER = 'Добавить пользователя'
    DELETE_USER = 'Удалить пользователя'

    ADD_NEW_LEASE_ENTRY = '🆕Забронировать квартиру'
    DELETE_ENTRY = 'Удалить запись об аренде'
    EDIT_ENTRY = 'Изменить запись об аренде'
    FIND_LEASE_ENTRY = '🔍Найти запись об аренде'
    UPLOAD_TO_EXCEL = 'Выгрузить таблицу с записями в excel'

    CONFIRM_PHOTOS_UPLOADING = '👍'

    FIND_LEASE_BY_PHONE_NUMBER = 'Искать по номеру'
    FIND_LEASE_BY_DATE = 'Искать по дате'

    CHECK_IN = 'Заселение'

    NO_DEPOSIT = 'Залог не нужен'
    MAKE_A_DEPOSIT = 'Внести залог'

    CONFIRM = 'Подтвердить'

    ADD_CLIENT_TO_BLACKLIST = 'Добавить в ЧС'
    REMOVE_CLIENT_FROM_BLACKLIST = 'Убрать из ЧС'

    BLACKLIST = 'Черный список'
    SHOW_CLIENT_DATA = 'Показать данные клиента'
